{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"audio_input": {"name": "audio_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64000"}]}}}, "outputs": {"Identity_18:0": {"name": "Identity_18:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_7:0": {"name": "Identity_7:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "65"}]}}, "Identity_13:0": {"name": "Identity_13:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_17:0": {"name": "Identity_17:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "60"}]}}, "Identity_24:0": {"name": "Identity_24:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_29:0": {"name": "Identity_29:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_9:0": {"name": "Identity_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_16:0": {"name": "Identity_16:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_25:0": {"name": "Identity_25:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "48000"}]}}, "Identity_8:0": {"name": "Identity_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_27:0": {"name": "Identity_27:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_12:0": {"name": "Identity_12:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "60"}]}}, "Identity_14:0": {"name": "Identity_14:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_5:0": {"name": "Identity_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_21:0": {"name": "Identity_21:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_28:0": {"name": "Identity_28:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "48000"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_15:0": {"name": "Identity_15:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_23:0": {"name": "Identity_23:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "65"}]}}, "Identity_6:0": {"name": "Identity_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_11:0": {"name": "Identity_11:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "60"}]}}, "Identity_22:0": {"name": "Identity_22:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_20:0": {"name": "Identity_20:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "65"}]}}, "Identity_19:0": {"name": "Identity_19:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}, "Identity_26:0": {"name": "Identity_26:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64000"}]}}, "Identity_10:0": {"name": "Identity_10:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1000"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "audio_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/mul_5/x", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/pow_1/x", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Cast_2", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "360"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/GatherV2_1/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Sum_1/reduction_indices", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Less/y", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Greater_1/y", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/HiddenMarkovModel/posterior_mode/strided_slice", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/ones", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "360"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/k", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/num_rows", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/num_cols", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/padding_value", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/mul_2/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/mul_3", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "360"}, {"size": "360"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_3/stack", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_3/stack_1", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_3/stack_2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/sub_3/x", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/Reshape_2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "360"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul-broadcastto_shape-0", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/Reshape_3", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "360"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul_1-broadcastto_shape-0", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Maximum_2/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Sum/reduction_indices", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_2/stack_1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_2/stack_2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Greater/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/zeros_like", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/mul/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/concat/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/ones_like/Shape/shape_as_tensor", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/ones_like/Const", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/floordiv_3/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/concat_1/values_1/1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/concat_1/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/range_1/start", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/range_1/delta", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/floordiv_2", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/Const", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/add/x", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad_1/paddings", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/packed", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/split/split_dim", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/Reshape/shape_1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/frame_length", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/frame_step", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/Reshape_2/shape/1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/Reshape_3", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/strided_slice", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Reshape/shape", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean/reduction_indices", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance/reduction_indices", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/SelectV2_3/e", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/input-reshape/strided_slice/stack", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/input-reshape/strided_slice/stack_1", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/input-reshape/strided_slice/stack_2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/input-reshape/Reshape/shape/1", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/input-reshape/Reshape/shape/2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/input-reshape/Reshape/shape/3", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}, {"size": "1"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv2/Conv2D/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}, {"size": "1024"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv2-BN/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv3/Conv2D/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv2-BN/FusedBatchNormV3/Offset", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv4/Conv2D/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv5/Conv2D/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv5/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv1-BN/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv6/Conv2D/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv6/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/transpose/transpose/perm", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/flatten/Const", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/classifier/MatMul/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "360"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv1-BN/FusedBatchNormV3/Offset", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/classifier/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "360"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Reshape_1/shape", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Reshape_2/shape", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/sub_4/y", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_4/stack", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_4/stack_1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_4/stack_2", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/strided_slice_5", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/SelectV2_4/e", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/SelectV2_5/e", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/GatherV2/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Sum_2/reduction_indices", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/truediv_5_recip", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Reshape_3/shape", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/ExpandDims/dim", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/LessEqual/y", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/SelectV2/t", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Maximum/x", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/zeros_like", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/mul/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like/Shape/shape_as_tensor", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like/Const", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/floordiv_3/y", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/values_1/1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_1/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/start", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/range_1/delta", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_2/shape/1", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape_3", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/strided_slice", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Const", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/add/x", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Reshape/shape_1", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_step", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame_length", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad/paddings", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/packed", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/split/split_dim", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/concat_2/axis", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/hann_window/sub_2", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/rfft/fft_length", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/mul/y", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "257"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Mean/reduction_indices", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/truediv", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Maximum_1/y", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv6-BN/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv6-BN/FusedBatchNormV3/Offset", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv5-BN/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv5-BN/FusedBatchNormV3/Offset", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv4-BN/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv4-BN/FusedBatchNormV3/Offset", "op": "Const", "input": ["^audio_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv3-BN/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/model/conv3-BN/FusedBatchNormV3/Offset", "op": "Const", "input": ["^audio_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag", "op": "MatrixDiagV3", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/ones", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/k", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/num_rows", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/num_cols", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag/padding_value"], "attr": {"align": {"s": "UklHSFRfTEVGVA=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/Reshape_2", "ConstantFolding/StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul-broadcastto_shape-0"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul_1", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/Reshape_3", "ConstantFolding/StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul_1-broadcastto_shape-0"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/ones_like", "op": "Fill", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/ones_like/Shape/shape_as_tensor", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/ones_like/Const"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad_1", "op": "Pad", "input": ["audio_input", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad_1/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like", "op": "Fill", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like/Shape/shape_as_tensor", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/ones_like/Const"], "attr": {"T": {"type": "DT_INT32"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad", "op": "Pad", "input": ["audio_input", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/eye/diag", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul", "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/meshgrid/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/frame/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Pad_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/audio_feature_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stft/frame/Shape", "op": "Shape", "input": 